backend/vertical-healthcare_ch/forum_datenaustausch_ch.invoice_440_request/src/test/resources/44_KANTON_49-01-2019_115414041.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><invoice:request xmlns:invoice="http://www.forum-datenaustausch.ch/invoice" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" language="de" modus="production" validation_status="0" xsi:schemaLocation="http://www.forum-datenaustausch.ch/invoice generalInvoiceRequest_440.xsd">
  <invoice:processing>
    <invoice:transport from="7601001432130" to="7601001234412">
      <invoice:via sequence_id="1" via="7609999032109"/>
    </invoice:transport>
  </invoice:processing>
  <invoice:payload copy="0" storno="0">
    <invoice:invoice request_date="2019-02-12T00:00:00" request_id="KANTON_49" request_timestamp="1549955384"/>
    <invoice:body place="association" role="other">
      <invoice:prolog>
        <invoice:package id="1" name="VeruA" version="100"/>
        <invoice:generator id="1" name="VeruA XML Generator" version="718"/>
      </invoice:prolog>
      <invoice:balance amount="35.15" amount_due="35.15" currency="CHF">
        <invoice:vat vat="0.00">
          <invoice:vat_rate amount="35.15" vat="0.00" vat_rate="0.0"/>
          <invoice:vat_rate amount="0.00" vat="0.00" vat_rate="2.5"/>
          <invoice:vat_rate amount="0.00" vat="0.00" vat_rate="7.7"/>
        </invoice:vat>
      </invoice:balance>
      <invoice:esr9 coding_line="0100000035152&gt;000000000001700000000000498+ 013050284&gt;" participant_number="01-123456-4" reference_number="00 00000 00001 70000 00000 00498" type="16or27"/>
      <invoice:tiers_payant>
        <invoice:biller ean_party="7601234567895" zsr="F123456">
          <invoice:person salutation="Herr">
            <invoice:familyname>Anonymous</invoice:familyname>
            <invoice:givenname>John</invoice:givenname>
            <invoice:postal>
              <invoice:zip countrycode="CH">4125</invoice:zip>
              <invoice:city>Riehen</invoice:city>
            </invoice:postal>
            <invoice:telecom>
              <invoice:phone>073 123 45 78</invoice:phone>
            </invoice:telecom>
            <invoice:online>
              <invoice:email>no.email@aol.com</invoice:email>
            </invoice:online>
          </invoice:person>
        </invoice:biller>
        <invoice:provider ean_party="7601234567895" zsr="F123456">
          <invoice:person salutation="Herr">
            <invoice:familyname>Anonymous</invoice:familyname>
            <invoice:givenname>John</invoice:givenname>
            <invoice:postal>
              <invoice:zip countrycode="CH">4125</invoice:zip>
              <invoice:city>Riehen</invoice:city>
            </invoice:postal>
            <invoice:telecom>
              <invoice:phone>073 123 45 78</invoice:phone>
            </invoice:telecom>
            <invoice:online>
              <invoice:email>no.email@aol.com</invoice:email>
            </invoice:online>
          </invoice:person>
        </invoice:provider>
        <invoice:insurance ean_party="7654321951357">
          <invoice:company>
            <invoice:companyname>Swica Gesundheitsorganisation</invoice:companyname>
            <invoice:department>Regionaldirektion Basel </invoice:department>
            <invoice:postal>
              <invoice:pobox>Postfach</invoice:pobox>
              <invoice:street>Aeschenplatz 2</invoice:street>
              <invoice:zip countrycode="CH">4052</invoice:zip>
              <invoice:city>Basel</invoice:city>
            </invoice:postal>
          </invoice:company>
        </invoice:insurance>
        <invoice:patient birthdate="1981-07-31T00:00:00" gender="male" ssn="7568889991234">
          <invoice:person salutation="Herr">
            <invoice:familyname>Pizza</invoice:familyname>
            <invoice:givenname>Margherita</invoice:givenname>
            <invoice:postal>
              <invoice:street>In einer Strasse</invoice:street>
              <invoice:zip countrycode="CH" statecode="BS">4125</invoice:zip>
              <invoice:city>Riehen</invoice:city>
            </invoice:postal>
          </invoice:person>
          <invoice:card card_id="01234567890123456789" expiry_date="2020-06-30T00:00:00"/>
        </invoice:patient>
        <invoice:guarantor>
          <invoice:company>
            <invoice:companyname>Gesundheitsdepartement Basel Stadt</invoice:companyname>
            <invoice:department>Bereich Gesundheitversorgung</invoice:department>
            <invoice:postal>
              <invoice:pobox>345</invoice:pobox>
              <invoice:street>Gerbergasse 256</invoice:street>
              <invoice:zip countrycode="CH">4001</invoice:zip>
              <invoice:city>Basel</invoice:city>
            </invoice:postal>
          </invoice:company>
        </invoice:guarantor>
        <invoice:referrer ean_party="7601002028127" zsr="I135792">
          <invoice:company>
            <invoice:companyname>Winter</invoice:companyname>
            <invoice:postal>
              <invoice:street>Gellertstrasse 144</invoice:street>
              <invoice:zip countrycode="CH">4052</invoice:zip>
              <invoice:city>Basel</invoice:city>
            </invoice:postal>
          </invoice:company>
        </invoice:referrer>
      </invoice:tiers_payant>
      <invoice:kvg insured_id="01234567890123456789"/>
      <invoice:treatment canton="BS" date_begin="2019-01-01T00:00:00" date_end="2019-01-31T00:00:00" reason="disease">
        <invoice:diagnosis type="freetext">Krankenpflege-Leistungsverordnung</invoice:diagnosis>
      </invoice:treatment>
      <invoice:services>
        <invoice:record_other amount="8.10" code="53201.1" date_begin="2019-01-10T11:00:00" date_end="2019-01-10T11:30:00" external_factor="1" name="Tarif a 1h" obligation="true" provider_id="F123456" quantity="30" record_id="1" responsible_id="I135792" session="1" tariff_type="532" unit="0.27" unit_factor="1" validate="true" vat_rate="0"/>
        <invoice:record_other amount="18.45" code="53202.1" date_begin="2019-01-10T11:30:00" date_end="2019-01-10T12:15:00" external_factor="1" name="Tarif b 1h" obligation="true" provider_id="F123456" quantity="45" record_id="2" responsible_id="I135792" session="1" tariff_type="532" unit="0.41" unit_factor="1" validate="true" vat_rate="0"/>
        <invoice:record_other amount="-8.00" code="53299" date_begin="2019-01-10T00:00:00" date_end="2019-01-10T00:00:00" external_factor="1" name="Abzugsposition Eigenbeitrag" obligation="true" provider_id="F123456" quantity="-60" record_id="3" responsible_id="I135792" session="1" tariff_type="532" unit="0.1333" unit_factor="1" validate="true" vat_rate="0"/>
        <invoice:record_other amount="24.60" code="53202.1" date_begin="2019-01-29T11:00:00" date_end="2019-01-29T12:00:00" external_factor="1" name="Tarif b 1h" obligation="true" provider_id="F123456" quantity="60" record_id="4" responsible_id="I135792" session="1" tariff_type="532" unit="0.41" unit_factor="1" validate="true" vat_rate="0"/>
        <invoice:record_other amount="-8.00" code="53299" date_begin="2019-01-29T00:00:00" date_end="2019-01-29T00:00:00" external_factor="1" name="Abzugsposition Eigenbeitrag" obligation="true" provider_id="F123456" quantity="-60" record_id="5" responsible_id="I135792" session="1" tariff_type="532" unit="0.1333" unit_factor="1" validate="true" vat_rate="0"/>
      </invoice:services>
    <invoice:documents number="1"><invoice:document filename="F123456_KANTON_49_verordnung.csv" mimeType="text/csv"><invoice:base64>YW5hIGFyZSBtZXJl</invoice:base64></invoice:document></invoice:documents></invoice:body>
  </invoice:payload>
</invoice:request>